import os
from flask import Flask, render_template
import random

app = Flask(__name__, static_folder='templates/static', template_folder='templates')

gua_data = {
    1: ["乾为天", "(乾卦)", "— — — — — —", "自强不息", "上上卦"],
    2: ["坤为地", "(坤卦)", "-- -- -- -- -- --", "厚德载物", "上上卦"],
    3: ["水雷屯", "(屯卦)", "-- — -- -- -- —", "积极建功", "下下卦"],
    4: ["山水蒙", "(蒙卦)", "— -- -- -- — --", "蒙以养正", "中下卦"],
    5: ["水天需", "(需卦)", "-- — -- — — —", "耐心等待", "中上卦"],
    6: ["天水讼", "(讼卦)", "— — — -- — --", "有礼有节", "中下卦"],
    7: ["地水师", "(师卦)", "-- -- -- -- — --", "以德选将", "中上卦"],
    8: ["水地比", "(比卦)", "-- — -- -- -- --", "亲贤远小", "上上卦"],
    9: ["风天小畜", "(小畜卦)", "— — -- — — —", "积小胜多", "下下卦"],
    10: ["天泽履", "(履卦)", "— — — -- — —", "言而有信", "中上卦"],
    11: ["地天泰", "(泰卦)", "-- -- -- — — —", "安康和谐", "中中卦"],
    12: ["天地否", "(否卦)", "— — — -- -- --", "否极泰来", "中中卦"],
    13: ["天火同人", "(同人卦)", "— — — — -- —", "团结一心", "中上卦"],
    14: ["火天大有", "(大有卦)", "— -- — — — —", "如日中天", "上上卦"],
    15: ["地山谦", "(谦卦)", "-- -- -- — -- --", "非吉则利", "中中卦"],
    16: ["雷地豫", "(豫卦)", "-- -- — -- -- --", "不可大意", "中中卦"],
    17: ["泽雷随", "(随卦)", "-- — — -- -- —", "随顺时势", "中中卦"],
    18: ["山风蛊", "(蛊卦)", "— -- -- — — --", "抵制蛊惑", "中下卦"],
    19: ["地泽临", "(临卦)", "-- -- -- -- — —", "审时度势", "中上卦"],
    20: ["风地观", "(观卦)", "— — -- -- -- --", "观而后学", "上上卦"],
    21: ["火雷噬嗑", "(噬嗑卦)", "— -- — -- -- —", "知法守法", "上上卦"],
    22: ["山火贲", "(贲卦)", "— -- -- — -- —", "以德服人", "中上卦"],
    23: ["山地剥", "(剥卦)", "— -- -- -- -- --", "置处逆境", "下下卦"],
    24: ["地雷复", "(复卦)", "-- -- -- -- -- —", "随顺机运", "中上卦"],
    25: ["天雷无妄", "(无妄卦)", "— — — -- -- —", "不可妄动", "下下卦"],
    26: ["山天大畜", "(大畜卦)", "— -- -- — — —", "大有积蓄", "中上卦"],
    27: ["山雷颐", "(颐卦)", "— -- -- -- -- —", "怡情养性", "上上卦"],
    28: ["泽风大过", "(大过卦)", "-- — — — — --", "物极必反", "中下卦"],
    29: ["坎为水", "(坎卦)", "-- — -- -- — --", "前路坎坷", "下下卦"],
    30: ["离为火", "(离卦)", "— -- — — -- —", "坚守正道", "中上卦"],
    31: ["泽山咸", "(咸卦)", "-- — — — -- --", "以情感人", "中上卦"],
    32: ["雷风恒", "(恒卦)", "-- -- — — — --", "保持恒心", "中上卦"],
    33: ["天山遁", "(遁卦)", "— — — — -- --", "明哲保身", "下下卦"],
    34: ["雷天大壮", "(大壮卦)", "-- -- — — — —", "遵守规矩", "中上卦"],
    35: ["火地晋", "(晋卦)", "— -- — -- -- --", "协同上级", "中上卦"],
    36: ["地火明夷", "(明夷卦)", "-- -- -- — -- —", "摇光养晦", "中下卦"],
    37: ["风火家人", "(家人卦)", "— — -- — -- —", "一天一家", "下下卦"],
    38: ["火泽睽", "(睽卦)", "— -- — -- — —", "求同存异", "下下卦"],
    39: ["水山蹇", "(蹇卦)", "-- — -- — -- --", "知难而退", "下下卦"],
    40: ["雷水解", "(解卦)", "-- -- — -- — --", "解除难局", "中上卦"],
    41: ["山泽损", "(损卦)", "— -- -- -- — —", "损而有利", "下下卦"],
    42: ["风雷益", "(益卦)", "— — -- -- -- —", "损上益下", "中上卦"],
    43: ["泽天夬", "(夬卦)", "-- — — — — —", "小人得志", "中下卦"],
    44: ["天风姤", "(姤卦)", "— — — — — --", "阳气始生", "上中卦"],
    45: ["泽地萃", "(萃卦)", "-- — — -- -- --", "齐心协力", "中上卦"],
    46: ["地风升", "(升卦)", "-- -- -- -- — —", "晋升之道", "上上卦"],
    47: ["泽水困", "(困卦)", "-- — — -- — --", "身困心亨", "中上卦"],
    48: ["水风井", "(井卦)", "-- — -- — — --", "勤恳服务", "中下卦"],
    49: ["泽火革", "(革卦)", "-- — — — -- —", "改故鼎新", "上上卦"],
    50: ["火风鼎", "(鼎卦)", "— -- — — — --", "建功立业", "中下卦"],
    51: ["震为雷", "(震卦)", "-- -- — -- -- —", "处变不惊", "中上卦"],
    52: ["艮为山", "(艮卦)", "— -- -- — -- --", "当止则止", "中下卦"],
    53: ["风山渐", "(渐卦)", "— — -- — -- --", "循序渐进", "上上卦"],
    54: ["雷泽归妹", "(归妹卦)", "-- -- — -- — —", "终则有始", "下下卦"],
    55: ["雷火丰", "(丰卦)", "-- -- — — -- —", "抓紧做事", "上上卦"],
    56: ["火山旅", "(旅卦)", "— -- — — -- --", "在外收敛", "下下卦"],
    57: ["巽为风", "(巽卦)", "— — -- — — --", "果断行事", "中上卦"],
    58: ["兑为泽", "(兑卦)", "-- — — -- — —", "性情若水", "上上卦"],
    59: ["风水涣", "(涣卦)", "— — -- -- — --", "先散后聚", "下下卦"],
    60: ["水泽节", "(节卦)", "-- — -- — — --", "适当节制", "上上卦"],
    61: ["风泽中孚", "(中孚卦)", "— — -- -- — —", "相待以诚", "下下卦"],
    62: ["雷山小过", "(小过卦)", "-- -- — — -- --", "低调为宜", "中上卦"],
    63: ["水火既济", "(既济卦)", "-- — -- — -- —", "先安后乱", "中上卦"],
    64: ["火水未济", "(未济卦)", "— -- — -- — --", "新的起点", "中下卦"]
}

def draw_gua():
    """
    随机抽取一个卦象，并返回格式化后的字符串。

    Returns:
      str: 格式化后的卦象信息字符串，例如: "第50卦  火风鼎（鼎卦）        建功立业  中下卦    — -- — — — --"
    """
    gua_keys = list(gua_data.keys())
    random_key = random.choice(gua_keys)
    gua_info = gua_data[random_key]
    return f"第{random_key}卦  {gua_info[0]} {gua_info[1]}        {gua_info[3]}  {gua_info[4]}    {gua_info[2]}"

@app.route('/')
def index():
    return render_template('index.html')

@app.route('/draw_gua')
def draw_gua_route():
    return draw_gua()

if __name__ == '__main__':
    app.run(host='0.0.0.0', debug=False)  # 修改了这里